Repository: SyllableOS/Syllable
Catalog: system/apps/gnu/textutils-2.0.21/po/*.po
Languages: sl

source: invalid argument %s for %s
sl: neveljaven argument %s za %s

source: ambiguous argument %s for %s
sl: dvoumen argument %s za %s

source: Valid arguments are:
sl: Veljavni argumenti so:

source: write error
sl: napaka pri pisanju

source: Unknown system error
sl: Neznana sistemska napaka

source: %s: option `%s' is ambiguous
sl: %s: izbira ,%s` je dvoumna

source: %s: option `--%s' doesn't allow an argument
sl: %s: izbira ,--%s` ne dovoljuje argumenta

source: %s: option `%c%s' doesn't allow an argument
sl: %s: izbira ,%c%s` ne dovoljuje argumenta

source: %s: option `%s' requires an argument
sl: %s: izbira ,%s` zahteva argument

source: %s: unrecognized option `--%s'
sl: %s: neprepoznana izbira ,-%s`

source: %s: unrecognized option `%c%s'
sl: %s: neprepoznana izbira ,%c%s`

source: %s: illegal option -- %c
sl: %s: nedovoljena izbira - %c

source: %s: invalid option -- %c
sl: %s: neveljavna izbira - %c

source: %s: option requires an argument -- %c
sl: %s: izbira zahteva argument - %c

source: %s: option `-W %s' is ambiguous
sl: %s: izbira ,-W %s` je dvoumna

source: %s: option `-W %s' doesn't allow an argument
sl: %s: izbira ,-W %s` ne dovoljuje argumenta

source: block size
sl: velikost bloka

source: cannot create directory %s
sl: ni mogoèe ustvariti imenika %s

source: %s exists but is not a directory
sl: %s obstaja, vendar ni imenik

source: cannot change owner and/or group of %s
sl: lastnika in/ali skupine %s ni mogoèe spremeniti

source: cannot chdir to directory, %s
sl: pomik v imenik ,%s` ni mo¾en

source: cannot change permissions of %s
sl: dovoljenj %s ni mogoèe spremeniti

source: memory exhausted
sl: pomnilnik porabljen

source: ^[yY]
sl: ^[jJdD]

source: cannot convert U+%04X to local character set
sl: pretvorba U+%04X v krajevni nabor znakov ni mogoèa

source: invalid user
sl: neveljaven uporabnik

source: invalid group
sl: neveljavna skupina

source: cannot get the login group of a numeric UID
sl: imena skupine, ki pripada ¹tevilènemu UID, ni mo¾no ugotoviti

source: cannot omit both user and group
sl: navesti je potrebno vsaj uporabnika ali skupino

source: Written by %s.
sl: Avtor %s.

source: This is free software; see the source for copying conditions. There is NO warranty; not even for MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
sl: To je prost program; pogoji, pod katerimi ga lahko razmno¾ujete in raz¹irjate so navedeni v izvorni kodi. Za program ni NOBENEGA jamstva, niti jamstev USTREZNOSTI ZA PRODAJO ali PRIMERNOSTI ZA UPORABO.

source: Torbjorn Granlund and Richard M. Stallman
sl: Torbjorn Granlund in Richard M. Stallman

source: Try `%s --help' for more information.
sl: Poskusite ,%s --help` za izèrpnej¹e informacije.

source: Usage: %s [OPTION] [FILE]...
sl: Uporaba: %s [IZBIRA] [DATOTEKA]...

source: Concatenate FILE(s), or standard input, to standard output. -A, --show-all equivalent to -vET -b, --number-nonblank number nonblank output lines -e equivalent to -vE -E, --show-ends display $ at end of each line -n, --number number all output lines -s, --squeeze-blank never more than one single blank line
sl: Prepi¹emo eno ali veè DATOTEK na standardni izhod, ali std. vhod na std. izhod. -A, --show-all enakovredno sestavljeni izbiri -vET -b, --number-nonblank o¹tevilèi neprazne izpisane vrstice -e enakovredno sestavljeni izbiri -vE -E, --show-ends izpi¹i $ na koncu vsake vrstice -n, --number o¹tevilèi vse izpisane vrstice -s, --squeeze-blank zaporedje veè praznih vrstic skrèi v eno

source: -t equivalent to -vT -T, --show-tabs display TAB characters as ^I -u (ignored) -v, --show-nonprinting use ^ and M- notation, except for LFD and TAB
sl: -t enakovredno sestavljeni izbiri -vT -T, --show-tabs prika¾i znake TAB kot ^I -u (ignorirano) -v, --show-nonprinting krmilne znake razen LF in TAB izpi¹i kot ^ and M-

source: With no FILE, or when FILE is -, read standard input.
sl: Èe DATOTEKA ni podana, ali pa je enaka -, beremo s standardnega vhoda.

source: -B, --binary use binary writes to the console device.
sl: -B, --binary pi¹i binarno na konzolo.

source: Report bugs to <bug-textutils@gnu.org>.
sl: Poroèila o napakah na <bug-textutils@gnu.org>.

source: cannot do ioctl on `%s'
sl: ioctl na ,%s` ni mo¾en

source: standard output
sl: standardni izhod

source: %s: input file is output file
sl: %s: vhodna in izhodna datoteka sta isti

source: %s: file too long
sl: %s: datoteka je predolga

source: Usage: %s [FILE]... or: %s [OPTION]
sl: Uporaba: %s [DATOTEKA]... ali: %s [IZBIRA]

source: Print CRC checksum and byte counts of each FILE.
sl: Izpi¹emo nadzorno vsoto in dol¾ino v bajtih za vsako DATOTEKO.

source: Richard Stallman and David MacKenzie
sl: Richard Stallman in David MacKenzie

source: Usage: %s [OPTION]... LEFT_FILE RIGHT_FILE
sl: Uporaba: %s [IZBIRA]... LEVA DESNA

source: Compare sorted files LEFT_FILE and RIGHT_FILE line by line. -1 suppress lines unique to left file -2 suppress lines unique to right file -3 suppress lines that appear in both files
sl: Urejeni datoteki LEVA in DESNA primerjamo vrstico za vrstico. -1 izpusti vrstice, ki se pojavijo samo v levi datoteki -2 izpusti vrstice, ki se pojavijo samo v desni datoteki -3 izpusti vrstice, ki se pojavijo v obeh datotekah

source: Stuart Kemp and David MacKenzie
sl: Stuart Kemp in David MacKenzie

source: read error
sl: napaka pri branju

source: input disappeared
sl: vhod je izginil

source: %s: line number out of range
sl: %s: ¹tevilka vrstice izven intervala

source: %s: `%s': line number out of range
sl: %s: ,%s`: ¹tevilka vrstice izven intervala

source: on repetition %d
sl: pri ponovitvi %d

source: %s: `%s': match not found
sl: %s: ,%s`: ujemanja ni

source: error in regular expression search
sl: napaka pri iskanju z regularnimi izrazi

source: write error for `%s'
sl: napaka pri pisanju za ,%s`

source: %s: `+' or `-' expected after delimeter
sl: %s: po razmejilniku prièakovana ,*` ali ,-`

source: %s: integer expected after `%c'
sl: %s: za ,%c` prièakovano celo ¹tevilo

source: %s: `}' is required in repeat count
sl: %s: pri ponovitvah je zahtevan ,}`

source: %s}: integer required between `{' and `}'
sl: %s}: med ,{` in ,}` je zahtevano celo ¹tevilo

source: %s: closing delimeter `%c' missing
sl: %s: zakljuèni razmejilnik ,%c` manjka

source: %s: invalid regular expression: %s
sl: %s: neveljaven regularni izraz: %s

source: %s: invalid pattern
sl: %s: neveljavni vzorec

source: %s: line number must be greater than zero
sl: %s: ¹tevilo vrstice mora biti pozitivno

source: line number `%s' is smaller than preceding line number, %s
sl: ¹tevilka vrstice ,%s` je ni¾ja od ¹tevilke vrstice pred njo, %s

source: warning: line number `%s' is the same as preceding line number
sl: opozorilo: ¹tevilka vrstice ,%s` je ista kot tista pred njo

source: missing conversion specifier in suffix
sl: manjkajoèe doloèilo pretvorbe v priponi

source: invalid conversion specifier in suffix: %c
sl: neveljavno doloèilo pretvorbe v priponi: %c

source: invalid conversion specifier in suffix: \%.3o
sl: neveljavno doloèilo pretvorbe v priponi: \\%.3o

source: missing %% conversion specification in suffix
sl: manjkajoèe doloèilo pretvorbe %% v priponi

source: too many %% conversion specifications in suffix
sl: preveè doloèil pretvorbe %% v priponi

source: %s: invalid number
sl: %s: neveljavno ¹tevilo

source: too few arguments
sl: premalo argumentov

source: Usage: %s [OPTION]... FILE PATTERN...
sl: Uporaba: %s [IZBIRA]... DATOTEKA VZOREC...

source: Output pieces of FILE separated by PATTERN(s) to files `xx01', `xx02', ..., and output byte counts of each piece to standard output.
sl: Kose DATOTEKE loèimo z VZORCEM in zapi¹emo v datoteke ,xx01`, ,xx02`..., ¹tevilo bajtov za posamièen kos pa izpi¹emo na standardni izhod.

source: Mandatory arguments to long options are mandatory for short options too.
sl: Èe je pri dolgi obliki izbire naveden argument, je ta obvezen tudi pri kratki.

source: -b, --suffix-format=FORMAT use sprintf FORMAT instead of %d -f, --prefix=PREFIX use PREFIX instead of `xx' -k, --keep-files do not remove output files on errors
sl: -b, --suffix-format=OBLIKA uporabi OBLIKO spritntf namesto %d -f, --prefix=PREDPONA uporabi podano PREDPONO namesto ,xx` -k, --keep-files ob napaki ne pobri¹i nepopolno zapisanih datotek

source: -n, --digits=DIGITS use specified number of digits instead of 2 -s, --quiet, --silent do not print counts of output file sizes -z, --elide-empty-files remove empty output files
sl: -n, --digits=©TEVKE uporabi navedeno ¹tevilo ¹tevk namesto privzetih 2 -s, --quiet, --silent brez izpisa velikosti na standardni izhod -z, --elide-empty-files odstrani prazne izhodne datoteke

source: Read standard input if FILE is -. Each PATTERN may be:
sl: Èe je DATOTEKA -, beremo s standardnega vhoda. VZOREC je lahko eden od:

source: INTEGER copy up to but not including specified line number /REGEXP/[OFFSET] copy up to but not including a matching line %REGEXP%[OFFSET] skip to, but not including a matching line {INTEGER} repeat the previous pattern specified number of times {*} repeat the previous pattern as many times as possible A line OFFSET is a required `+' or `-' followed by a positive integer.
sl: CELO_©TEVILO prepi¹i do navedene vrstice, ne v¹tev¹i te vrstice /REGIZR/[ODMIK] prepi¹i do ODMIKA, ne v¹tev¹i ujemajoèe se vrstice %%REGIZR%%[ODMIK] preskoèi na ODMIK, ne v¹tev¹i ujemajoèe se vrstice {CELO_©TEVILO} ponovi prej¹nji regularni izraz navedenokrat {*} ponovi prej¹nji regularni izraz, kolikorkrat gre Zapis vrstice ODMIKA je znak ,+` ali ,-`, ki mu sledi pozitivno celo ¹tevilo.

source: David Ihnat, David MacKenzie, and Jim Meyering
sl: David Ihnat, David MacKenzie in Jim Meyering

source: Usage: %s [OPTION]... [FILE]...
sl: Uporaba: %s [IZBIRA]... [DATOTEKA]...

source: Print selected parts of lines from each FILE to standard output.
sl: Izbrane dele vrstic iz vsake od navedenih DATOTEK izpi¹emo na standardni izhod.

source: -b, --bytes=LIST output only these bytes -c, --characters=LIST output only these characters -d, --delimiter=DELIM use DELIM instead of TAB for field delimiter
sl: -b, --bytes=SEZNAM izpi¹i samo navedene bajte -c, --characters=SEZNAM izpi¹i samo navedene znake -d, --delimiter=RAZMEJ polja so razmejena z znakom RAZMEJ namesto s TAB

source: -f, --fields=LIST output only these fields; also print any line that contains no delimiter character, unless the -s option is specified -n (ignored)
sl: -f, --fields=SEZNAM izpi¹i samo navedena polja; izpi¹i tudi vse vrstice, ki ne vsebujejo razmejevalnika, razen èe je v rabi izbira -s -n (prezrto)

source: -s, --only-delimited do not print lines not containing delimiters --output-delimiter=STRING use STRING as the output delimiter the default is to use the input delimiter
sl: -s, --only-delimited ne izpi¹i vrstic, ki ne vsebujejo razmejevalnika --output-delimiter=NIZ naj bo NIZ razmejevalnik na izhodu privzeti izhodni razmejevalnik je enak vhodnemu

source: Use one, and only one of -b, -c or -f. Each LIST is made up of one range, or many ranges separated by commas. Each range is one of: N N'th byte, character or field, counted from 1 N- from N'th byte, character or field, to end of line N-M from N'th to M'th (included) byte, character or field -M from first to M'th (included) byte, character or field With no FILE, or when FILE is -, read standard input.
sl: Izbire -b, -c in -f se medsebojno izkljuèujejo. Vsak SEZNAM lahko sestavlja en ali veè razponov, ki so med seboj loèeni z vejico. Vsak razpon ima lahko obliko: N N-ti bajt, znak ali polje, ¹teto od 1 dalje N- od N-tega bajta, znaka ali polja do konca vrstice N-M od N-tega do vkljuèno M-tega bajta, znaka ali polja -M od prvega do vkljuèno M-tega bajta, znaka ali polja Èe DATOTEKA ni podana, ali èe je enaka - (minusu), se bere standardni vhod.

source: invalid byte or field list
sl: neveljaven seznam bajtov ali polj

source: only one type of list may be specified
sl: doloèen je lahko samo en tip seznama

source: missing list of positions
sl: seznam polo¾ajev manjka

source: missing list of fields
sl: seznam polj manjka

source: the delimiter must be a single character
sl: razmejilnik mora biti en sam znak

source: you must specify a list of bytes, characters, or fields
sl: podati je treba seznam bajtov, znakov ali polj

source: a delimiter may be specified only when operating on fields
sl: razmejilnik se sme doloèiti le, kadar delamo s polji

source: suppressing non-delimited lines makes sense only when operating on fields
sl: neizpisovanje vrstic, ki ne vsebujejo razmejilnika je smiselno le, kadar delamo s polji

source: Convert tabs in each FILE to spaces, writing to standard output. With no FILE, or when FILE is -, read standard input.
sl: Tabulatorje v vsaki od DATOTEK nadomestimo s presledki in rezultat izpi¹emo na standardni izhod. Èe DATOTEKA ni podana, ali èe je enaka - (minus), beremo s standardnega vhoda.

source: -i, --initial do not convert TABs after non whitespace -t, --tabs=NUMBER have tabs NUMBER characters apart, not 8
sl: -i, --initial nadomesti samo tabulatorje, ki sledijo praznim znakom -t, --tabs=©IRINA ©IRINA tabulatorja naj bo navedeno namesto 8

source: -t, --tabs=LIST use comma separated list of explicit tab positions
sl: -t, --tabs=SEZNAM uporabi z vejicami loèen SEZNAM eksplicitnih tabulatorjev

source: tab size contains an invalid character
sl: ¹irina tabulatorja vsebuje neveljaven znak

source: tab size cannot be 0
sl: ¹irina tabulatorja ne more biti 0

source: tab sizes must be ascending
sl: seznam tabulatorjev mora biti nara¹èajoè

source: Usage: %s [-DIGITS] [OPTION]... [FILE]...
sl: Uporaba: %s [-©TEVKE] [IZBIRA]... [DATOTEKA]...

source: Reformat each paragraph in the FILE(s), writing to standard output. If no FILE or if FILE is `-', read standard input.
sl: Vsak odstavek v DATOTEKI(-ah) preoblikujemo in izpi¹emo na standardni izhod. Èe DATOTEKA ni podana ali je enaka - (minus), beremo s standardnega vhoda.

source: -c, --crown-margin preserve indentation of first two lines -p, --prefix=STRING combine only lines having STRING as prefix -s, --split-only split long lines, but do not refill
sl: -c, --crown-margin ohrani zamik prvih dveh vrstic -p, --prefix=NIZ preoblikuj samo vrstice, ki se zaèno z NIZOM -s, --split-only pore¾i predolge vrstice, a brez poravnave

source: -t, --tagged-paragraph indentation of first line different from second -u, --uniform-spacing one space between words, two after sentences -w, --width=NUMBER maximum line width (default of 75 columns)
sl: -t, --tagged-paragraph zamik prve vrstice v odstavku je razlièen od ostalih -u, --uniform-spacing en presledek med besedami, dva za piko -w, --width=©IRINA najveèja ¹irina vrstice (privzeto 75 znakov)

source: In -wNUMBER, the letter `w' may be omitted.
sl: Izbiro -w©TEVILO lahko uporabimo tudi v obliki -©TEVILO.

source: invalid width option: `%s'
sl: neveljavna izbira ¹irine: ,%s`

source: invalid width: `%s'
sl: neveljavna ¹irina: ,%s`

source: Wrap input lines in each FILE (standard input by default), writing to standard output.
sl: Vrstice v vsaki DATOTEKI na vhodu (privzet je standardni vhod) prelomimo in rezultat izpi¹emo na standardni izhod.

source: -b, --bytes count bytes rather than columns -s, --spaces break at spaces -w, --width=WIDTH use WIDTH columns instead of 80
sl: -b, --bytes ¹tejemo bajte namesto znakov -s, --spaces prelom na presledkih -w, --width=©IRINA nastavimo ©IRINO vrstic (privzeto 80)

source: invalid number of columns: `%s'
sl: neveljavna ¹irina: ,%s`

source: Print first 10 lines of each FILE to standard output. With more than one FILE, precede each with a header giving the file name. With no FILE, or when FILE is -, read standard input.
sl: Izpi¹emo prvih 10 vrstic vsake od DATOTEK na standardni izhod. Èe je podana veè kot ena DATOTEKA, pred vsebino izpi¹emo ¹e ime datoteke. Èe DATOTEKA ni podana, ali èe je enaka -, beremo s standardnega vhoda.

source: -c, --bytes=SIZE print first SIZE bytes -n, --lines=NUMBER print first NUMBER lines instead of first 10
sl: -c, --bytes=VELIKOST izpi¹emo prvih VELIKOST bajtov z zaèetka datoteke -n, --lines=©TEVILO izpi¹emo dano ©TEVILO vrstic namesto prvih 10

source: -q, --quiet, --silent never print headers giving file names -v, --verbose always print headers giving file names
sl: -q, --quiet, --silent vedno brez izpisa imena datoteke -v, --verbose vedno izpi¹emo ¹e ime datoteke

source: SIZE may have a multiplier suffix: b for 512, k for 1K, m for 1 Meg.
sl: VELIKOST ima lahko pripono b za mno¾enje s 512, k za 1024 ali m za 1048576.

source: standard input
sl: standardni vhod

source: %s: %s is so large that it is not representable
sl: %s: %s je tako veliko, da ni predstavljivo

source: number of lines
sl: ¹tevilo vrstic

source: number of bytes
sl: ¹tevilo bajtov

source: invalid number of lines
sl: neveljavno ¹tevilo vrstic

source: invalid number of bytes
sl: neveljavno ¹tevilo bajtov

source: unrecognized option `-%c'
sl: neprepoznana izbira ,-%c`

source: Usage: %s [OPTION]... FILE1 FILE2
sl: Uporaba: %s [IZBIRA]... DATOTEKA1 DATOTEKA2

source: For each pair of input lines with identical join fields, write a line to standard output. The default join field is the first, delimited by whitespace. When FILE1 or FILE2 (not both) is -, read standard input. -a SIDE print unpairable lines coming from file SIDE -e EMPTY replace missing input fields with EMPTY
sl: Za vsak par vrstic na vhodu z enakimi zdru¾itvenimi polji izpi¹emo vrstico na standardni izhod. Privzeto zdru¾itveno polje je prvo, loèeno s praznim prostorom. Èe sta DATOTEKA1 ali DATOTEKA2 (ne pa obe hkrati) enaki -, beremo s standardnega vhoda. -a STRAN izpi¹emo vrstice brez para, ki izvirajo iz navedene STRANI -e PRAZNO manjkajoèe vhodno polje nadomestimo z nizom PRAZNO

source: -i, --ignore-case ignore differences in case when comparing fields -j FIELD (obsolescent) equivalent to `-1 FIELD -2 FIELD' -j1 FIELD (obsolescent) equivalent to `-1 FIELD' -j2 FIELD (obsolescent) equivalent to `-2 FIELD' -o FORMAT obey FORMAT while constructing output line -t CHAR use CHAR as input and output field separator
sl: -i, --ignore-case pri primerjanju obravnavamo velike in male èrke enako -j POLJE (zastarelo) isto kot ,-1 POLJE -2 POLJE` -j1 POLJE (zastarelo) isto kot ,-1 POLJE` -j2 POLJE (zastarelo) isto kot ,-2 POLJE` -o OBLIKA pri izpisu uporabimo predpisano OBLIKO -t ZNAK navedeni ZNAK naj bo loèilo med polji na vhodu in izhodu

source: -v SIDE like -a SIDE, but suppress joined output lines -1 FIELD join on this FIELD of file 1 -2 FIELD join on this FIELD of file 2
sl: -v STRAN isto kot -a STRAN, vendar brez zdru¾enih izhodnih vrstic -1 POLJE zdru¾ujemo glede na navedeno POLJE v prvi datoteki -2 POLJE zdru¾ujemo glede na navedeno POLJE v drugi datoteki

source: Unless -t CHAR is given, leading blanks separate fields and are ignored, else fields are separated by CHAR. Any FIELD is a field number counted from 1. FORMAT is one or more comma or blank separated specifications, each being `SIDE.FIELD' or `0'. Default FORMAT outputs the join field, the remaining fields from FILE1, the remaining fields from FILE2, all separated by CHAR.
sl: Èe izbira -t ZNAK ni podana, vodilna prazna polja loèujejo polja in se ne upo¹tevajo, sicer pa ZNAK loèuje polja. POLJE je ¹tevilka polja, ¹teto od 1 dalje. OBLIKA je eno ali veè z vejico ali presledkom loèenih doloèil, vsako od njih je oblike ,STRAN.POLJE` ali ,0`. Privzeta OBLIKA izpi¹e zdru¾itveno polje, vsa preostala polja iz DATOTEKE1, in zatem ¹e vsa preostala polja iz DATOTEKE2; loèilo med polji je ZNAK.

source: invalid field specifier: `%s'
sl: neveljavno doloèilo polja: ,%s`

source: invalid field number: `%s'
sl: neveljavna ¹tevilka polja: ,%s`

source: invalid file number in field spec: `%s'
sl: neveljavna ¹tevilka datoteke v doloèilu polja: ,%s`

source: invalid field number for file 1: `%s'
sl: neveljavna ¹tevilka polja za prvo datoteko: ,%s`

source: invalid field number for file 2: `%s'
sl: neveljavna ¹tevilka polja za drugo datoteko: ,%s`

source: too many non-option arguments
sl: preveè neizbirnih argumentov

source: too few non-option arguments
sl: premalo neizbirnih argumentov

source: both files cannot be standard input
sl: obeh datotek ne moremo hkrati brati s standardnega vhoda

source: Ulrich Drepper and Scott Miller
sl: Ulrich Drepper in Scott Miller

source: Usage: %s [OPTION] [FILE]... or: %s [OPTION] --check [FILE] Print or check %s (%d-bit) checksums. With no FILE, or when FILE is -, read standard input.
sl: Uporaba: %s [IZBIRA] [DATOTEKA]... ali: %s [IZBIRA] --check [DATOTEKA] Izpi¹emo ali preverimo nadzorne vsote %s (%d-bitne). Èe DATOTEKA ni podana, ali èe je enaka -, beremo s standardnega vhoda.

source: -b, --binary read files in binary mode (default on DOS/Windows) -c, --check check %s sums against given list -t, --text read files in text mode (default)
sl: -b, --binary datoteke beremo v binarnem naèinu (privzeto v okoljih DOS/Windows) -c, --check izraèunane nadzorne vsote %s primerjamo z vrednostmi v navedeni datoteki -t, --text datoteke beremo v besedilnem naèinu (privzeto)

source: The following two options are useful only when verifying checksums: --status don't output anything, status code shows success -w, --warn warn about improperly formated checksum lines
sl: Naslednji dve izbiri sta uporabni le pri preverjanju nadzornih vsot: --status brez izpisa, izhodna statusna koda ka¾e uspeh -w, --warn z opozorili pri nepravilno oblikovanih vrsticah z nadzornimi vsotami MD5

source: The sums are computed as described in %s. When checking, the input should be a former output of this program. The default mode is to print a line with checksum, a character indicating type (`*' for binary, ` ' for text), and name for each FILE.
sl: Izraèun nadzornih vsot je opisan v %s. Pri preverjanju mora biti datoteka z vrednostmi v enaki obliki kot izpis programa. Privzet naèin je izpis vrstice z nadzorno vsoto, statusnim znakom (,*` za binarne, , ` za besedilne datoteke) in imenom DATOTEKE, za katero je bila izraèunana nadzorna vsota.

source: %s: %lu: improperly formatted %s checksum line
sl: %s: %lu: nepravilno oblikovana vrstica z nadzorno vsoto %s

source: %s: FAILED open or read
sl: %s: NAPAKA pri odpiranju ali branju

source: FAILED
sl: NAPAKA

source: OK
sl: V REDU

source: %s: read error
sl: %s: napaka pri branju

source: %s: no properly formatted %s checksum lines found
sl: %s: nobene pravilno oblikovane vrstice z nadzorno vsoto %s ni najti

source: WARNING: %d of %d listed %s could not be read
sl: OPOZORILO: %d od %d navedenih %s se ne da prebrati

source: file
sl: na¹tete datoteke

source: files
sl: na¹tetih datotek

source: WARNING: %d of %d computed %s did NOT match
sl: OPOZORILO: %d od %d %s se NE ujema.

source: checksum
sl: izraèunane nadzorne vsote

source: checksums
sl: izraèunanih nadzornih vsot

source: the --binary and --text options are meaningless when verifying checksums
sl: izbiri --binary in --text nista smiselni pri preverjanju nadzornih vsot

source: the --string and --check options are mutually exclusive
sl: izbiri --string in --check se medsebojno izkljuèujeta

source: the --status option is meaningful only when verifying checksums
sl: izbira --status je smiselna samo pri preverjanju nadzornih vsot

source: the --warn option is meaningful only when verifying checksums
sl: izbira --warn je smiselna samo pri preverjanju nadzornih vsot

source: no files may be specified when using --string
sl: pri izbiri --string ne sme biti podana nobena datoteka

source: only one argument may be specified when using --check
sl: pri izbiri --check sme biti doloèen samo en argument

source: Scott Bartram and David MacKenzie
sl: Scott Bartram in David MacKenzie
