Repository: SyllableOS/Syllable
Catalog: system/apps/gnu/textutils-2.0.21/po/*.po
Languages: sl

source: extra operand `%s' not allowed with -c
sl: dodatni operand ,%s` pri izbiri -c ni dovoljen

source: Usage: %s [OPTION] [INPUT [PREFIX]]
sl: Uporaba: %s [IZBIRA] [VHOD [PREDPONA]]

source: Output fixed-size pieces of INPUT to PREFIXaa, PREFIXab, ...; default PREFIX is `x'. With no INPUT, or when INPUT is -, read standard input.
sl: Datoteko VHOD razre¾emo na kose enake dol¾ine, ki jih poimenujemo PREDPONAaa, PREDPONAab...; privzeta PREDPONA je ,x`. Èe VHOD ni podan ali je enak -, beremo s standardnega vhoda.

source: creating file `%s'
sl: ustvarjamo datoteko ,%s`

source: cannot split in more than one way
sl: razcep na veè kot en naèin ni mo¾en

source: %s: invalid number of bytes
sl: %s: neveljavno ¹tevilo bajtov

source: %s: invalid number of lines
sl: %s: neveljavno ¹tevilo vrstic

source: invalid number
sl: neveljavno ¹tevilo

source: too many arguments
sl: preveè argumentov

source: Kayvan Aghaiepour and David MacKenzie
sl: Kayvan Aghaiepour in David MacKenzie

source: Print checksum and block counts for each FILE. -r defeat -s, use BSD sum algorithm, use 1K blocks -s, --sysv use System V sum algorithm, use 512 bytes blocks
sl: Za vsako podano DATOTEKO izraèunamo nadzorno vsoto in izpi¹emo ¹tevilo blokov. -r preklièemo -s; algoritem BSD, velikost blokov 1 KB -s, --sysv raèunanje vsote z algoritmom System V, velikost blokov 512 B

source: --help display this help and exit
sl: --help ta navodila

source: --version output version information and exit
sl: --version razlièica programa

source: Jay Lepreau and David MacKenzie
sl: Jay Lepreau in David MacKenzie

source: Write each FILE to standard output, last line first. With no FILE, or when FILE is -, read standard input.
sl: Vsako od DATOTEK prepi¹emo na standardni izhod v obratnem vrstnem redu, od zadnje vrstice proti prvi. Èe DATOTEKA ni podana ali je enaka -, beremo s standardnega vhoda.

source: -b, --before attach the separator before instead of after -r, --regex interpret the separator as a regular expression -s, --separator=STRING use STRING as the separator instead of newline
sl: -b, --before loèilo dodamo pred, ne za izpisano vrstico -r, --regex loèila obravnavamo kot regularne izraze -s, --separator=NIZ vrstice naj loèuje NIZ, ne znak za novo vrstico

source: stdin: read error
sl: stdin: napaka pri branju

source: separator cannot be empty
sl: loèilo ne more biti prazno

source: Print the last %d lines of each FILE to standard output. With more than one FILE, precede each with a header giving the file name. With no FILE, or when FILE is -, read standard input.
sl: Zadnjih %d vrstic vsake od podanih DATOTEK izpi¹emo na standardni izhod. Èe je podana veè kot ena DATOTEKA, izpi¹emo pred tem ¹e glavo z imenom datoteke. Èe DATOTEKA ni podana ali je enaka -, beremo s standardnega vhoda.

source: --retry keep trying to open a file even if it is inaccessible when tail starts or if it becomes inaccessible later -- useful only with -f -c, --bytes=N output the last N bytes
sl: --retry datoteko posku¹amo odpreti, èetudi ni dostopna v trenutku, ko po¾enemo tail ali kdaj kasneje -- uporabno skupaj z izbiro -f -c, --bytes=N izpi¹emo zadnjih N bajtov datoteke

source: -f, --follow[={name|descriptor}] output appended data as the file grows; -f, --follow, and --follow=descriptor are equivalent -F same as --follow=name --retry
sl: -f, --follow[={name|descriptor}] pri datotekah, ki rastejo, sledimo trenutnemu koncu datoteke; -f, --follow in --follow=descriptor so sopomenke -F isto kot --follow=name --retry

source: -n, --lines=N output the last N lines, instead of the last %d --max-unchanged-stats=N with --follow=name, reopen a FILE which has not changed size after N (default %d) iterations to see if it has been unlinked or renamed (this is the usual case of rotated log files)
sl: -n, --lines=N izpi¹emo zadnjih N vrstic namesto privzetih %d --max-unchanged-stats=N skupaj z --follow=name, ponovno odpri DATOTEKO, ki se ni spremenila v zadnjih N (privzeto %d) branjih; s tem preverimo, ali vmes ni bila izbrisana ali preimenovana (uporabno pri dnevni¹kih datotekah)

source: --pid=PID with -f, terminate after process ID, PID dies -q, --quiet, --silent never output headers giving file names -s, --sleep-interval=S with -f, each iteration lasts approximately S (default 1) seconds -v, --verbose always output headers giving file names
sl: --pid=PID skupaj z -f, proces zakljuèimo, ko PID ugasne -q, --quiet, --silent vedno brez izpisa glave z imenom datoteke -s, --sleep-interval=S skupaj z -f; premor S sekund med ponovitvami -v, --verbose vedno z izpisom glave z imenom datoteke

source: With --follow (-f), tail defaults to following the file descriptor, which means that even if a tail'ed file is renamed, tail will continue to track its end.
sl: Z izbiro --follow (-f) tail privzeto sledi deskriptorju datoteke, kar pomeni, da konec datoteke sledimo tudi, èe je ta vmes preimenovana.

source: closing %s (fd=%d)
sl: zapiramo %s (fd=%d)

source: %s: cannot seek to offset %s%s
sl: %s: premik na odmik %s%s ni mogoè

source: %s: cannot seek to relative offset %s%s
sl: %s: premik na relativni odmik %s%s ni mogoè

source: %s: cannot seek to end-relative offset %s%s
sl: %s: premik na odmik %s%s (relativno od konca) ni mogoè

source: `%s' has become inaccessible
sl: ,%s` je postala nedostopna

source: `%s' has been replaced with an untailable file; giving up on this name
sl: ,%s` je bila nadome¹èena z datoteko, kateri ni moè slediti konca; opu¹èamo

source: `%s' has become accessible
sl: ,%s` je postala dostopna

source: `%s' has appeared; following end of new file
sl: ,%s` se je pojavila; sledimo konec nove datoteka

source: `%s' has been replaced; following end of new file
sl: ,%s` je bila zamenjana; sledimo konec nove datoteke

source: %s: file truncated
sl: %s: datoteka je porezana

source: no files remaining
sl: nobene datoteke ni veè

source: %s: cannot follow end of this type of file; giving up on this name
sl: %s: koncu te zvrsti datoteke ni mo¾no slediti; s tem imenom odnehamo

source: %c: invalid suffix character in obsolescent option
sl: %c: neveljavna enoznakovna pripona pri zastareli izbiri

source: too many arguments; When using tail's obsolescent option syntax (%s) there may be no more than one file argument. Use the equivalent -n or -c option instead.
sl: preveè argumentov: Pri stari skladnji izbir (%s) lahko podamo kot argument le eno datoteko. Namesto tega uporabite izbiri -n ali -c.

source: Warning: it is not portable to use two or more file arguments with tail's obsolescent option syntax (%s). Use the equivalent -n or -c option instead.
sl: Opozorilo: pri uporabi stare skladnje (%s) navedba dveh ali veè datotek ni prenosljiva. Namesto nje uporabite izbiri -n ali -c.

source: %s: is so large that it is not representable
sl: %s: je tako veliko, da ni predstavljivo

source: %s is larger than the maximum file size on this system
sl: %s presega najveèjo dovoljeno velikost datoteke na tem sistemu

source: %s: invalid maximum number of unchanged stats between opens
sl: %s: neveljavno najveèje ¹tevilo nespremenjenih statusov med odpiranji

source: %s: invalid maximum number of consecutive size changes
sl: %s: neveljavno najveèje ¹tevilo zaporednih sprememb velikosti

source: %s: invalid PID
sl: %s: neveljavno ¹tevilo PID

source: %s: invalid number of seconds
sl: %s: neveljavno ¹tevilo sekund

source: warning: --retry is useful only when following by name
sl: opozorilo: izbira --retry je uporabna le, kadar ji sledi ime

source: warning: PID ignored; --pid=PID is useful only when following
sl: opozorilo: PID ignoriran; --pid=PID je uporabno samo pri sledenju

source: warning: --pid=PID is not supported on this system
sl: opozorilo: izbira --pid=PID na tem sistemu ni podprta

source: Usage: %s [OPTION]... SET1 [SET2]
sl: Uporaba: %s [IZBIRA]... MNO®ICA1 [MNO®ICA2]

source: Translate, squeeze, and/or delete characters from standard input, writing to standard output. -c, --complement first complement SET1 -d, --delete delete characters in SET1, do not translate -s, --squeeze-repeats replace sequence of characters with one -t, --truncate-set1 first truncate SET1 to length of SET2
sl: Prevedemo, stisnemo ali pobri¹emo znake iz toka podatkov na standardnem vhodu in rezultat pi¹emo na standardni izhod. -c, --complement komplement MNO®ICE 1. -d, --delete pobri¹emo znake, navedene v MNO®ICI 1. -s, --squeeze-repeats sosledje enakih znakov nadomestimo z enim samim znakom -t, --truncate-set1 MNO®ICO 1 najprej skrèimo na velikost MNO®ICE 2.

source: SETs are specified as strings of characters. Most represent themselves. Interpreted sequences are: \NNN character with octal value NNN (1 to 3 octal digits) \\ backslash \a audible BEL \b backspace \f form feed \n new line \r return \t horizontal tab
sl: MNO®ICE doloèajo nizi znakov. Veèinoma predstavljajo sebe, posebej pa se tolmaèijo naslednja zaporedja: \\NNN znak z osmi¹ko kodo NNN (dol¾ina 1, 2 ali 3 osmi¹ke ¹tevke) \\\\ nagibnica \\a zvonèek \\b pomik za en znak v levo \\f skok na novo stran \\n skok v novo vrstico \\r pomik na levi rob \\t vodoravni tabulator

source: \v vertical tab CHAR1-CHAR2 all characters from CHAR1 to CHAR2 in ascending order [CHAR*] in SET2, copies of CHAR until length of SET1 [CHAR*REPEAT] REPEAT copies of CHAR, REPEAT octal if starting with 0 [:alnum:] all letters and digits [:alpha:] all letters [:blank:] all horizontal whitespace [:cntrl:] all control characters [:digit:] all digits
sl: \\v navpièni tabulator ZNAK1-ZNAK2 nara¹èajoèe zaporedje znakov od ZNAKA1 do ZNAKA2 [ZNAK1-ZNAK2] isto kot ZNAK1-ZNAK2, èe to uporabljata obe mno¾ici [ZNAK*] v MNO®ICI 2; toliko ponovitev ZNAKA kot v MNO®ICI 1 [ZNAK*N] N ponovitev znaka; osmi¹ka vrednost, èe se N zaène z nièlo [:alnum:] vse èrke in ¹tevke [:alpha:] vse èrke [:blank:] vsi vodoravni prazni znaki [:cntrl:] vsi krmilni znaki [:digit:] vse ¹tevke

source: [:graph:] all printable characters, not including space [:lower:] all lower case letters [:print:] all printable characters, including space [:punct:] all punctuation characters [:space:] all horizontal or vertical whitespace [:upper:] all upper case letters [:xdigit:] all hexadecimal digits [=CHAR=] all characters which are equivalent to CHAR
sl: [:graph:] vsi izpisljivi znaki razen presledka [:lower:] vse male èrke [:print:] vsi izpisljivi znaki s presledkom vred [:punct:] vsa loèila [:space:] vsi prazni znaki, vodoravni in navpièni [:upper:] vse velike èrke [:xdigit:] vse ¹estnajsti¹ke ¹tevke [=ZNAK=] vsi znaki, ki so enakovredni navedenemu ZNAKU

source: Translation occurs if -d is not given and both SET1 and SET2 appear. -t may be used only when translating. SET2 is extended to length of SET1 by repeating its last character as necessary.
sl: Èe izbira -d ni podana in sta navedeni tako MNO®ICA1 kot MNO®ICA2, se privzame prevedba. Izbira -t se sme uporabiti samo ob prevedbi. Èe je MNO®ICA 2 kraj¹a od MNO®ICE 1, se privzame ponovitev zadnjega znaka v MNO®ICI 2 do dol¾ine MNO®ICE 1.

source: Excess characters of SET2 are ignored. Only [:lower:] and [:upper:] are guaranteed to expand in ascending order; used in SET2 while translating, they may only be used in pairs to specify case conversion.
sl: Znaki, ki v MNO®ICI 2 segajo prek dol¾ine MNO®ICE 1, se zavr¾ejo. Edino razreda [:lower:] in [:upper:] se zajamèeno raz¹irita v nara¹èajoèem vrstnem redu. Èe je kateri od njiju naveden v MNO®ICI 2, ju lahko uporabimo le za pretvorbo med velikimi in malimi èrkami.

source: -s uses SET1 if not translating nor deleting; else squeezing uses SET2 and occurs after translation or deletion.
sl: Izbira -s uporablja MNO®ICO 1, kadar ne prevajamo ali bri¹emo, sicer pa stiskanje uporablja MNO®ICO 2 in se izvede po prevajanju in brisanju.

source: warning: the ambiguous octal escape \%c%c%c is being interpreted as the 2-byte sequence \0%c%c, `%c'
sl: opozorilo: dvoumno osmi¹ko ube¾no zaporedje \%c%c%c tolmaèimo kot dvobajtno zaporedje \0%c%c, ,%c`

source: invalid backslash escape at end of string
sl: neveljavno ube¾no zaporedje na koncu niza

source: invalid backslash escape `\%c'
sl: neveljavno ube¾no zaporedje ,\%c`

source: range-endpoints of `%s-%s' are in reverse collating sequence order
sl: meji obsega ,%s-%s` nista navedeni v nara¹èajoèem abecednem redu

source: invalid repeat count `%s' in [c*n] construct
sl: neveljavno ¹tevilo ponavljanj ,%s` v konstruktu [c*n]

source: invalid character class `%s'
sl: neveljaven razred znakov ,%s`

source: %s: equivalence class operand must be a single character
sl: %s: operand ekvivalentnih razredov sme biti en sam znak

source: the [c*] repeat construct may not appear in string1
sl: konstrukt ponovitev znaka [c*] se ne sme pojaviti v nizu 1

source: only one [c*] repeat construct may appear in string2
sl: kveèjemu en konstrukt ponovitev znaka [c*] se sme pojaviti v nizu 2

source: [=c=] expressions may not appear in string2 when translating
sl: izrazi [=c=] se pri prevedbi ne smejo pojavljati v nizu 2

source: when not truncating set1, string2 must be non-empty
sl: kadar ne kraj¹amo niza 1, mora biti niz 2 neprazen

source: when translating with complemented character classes, string2 must map all characters in the domain to one
sl: pri prevedbi s komplementi znakovnih razredov mora niz 2 preslikati vse znake iz domene v enega

source: when translating, the only character classes that may appear in string2 are `upper' and `lower'
sl: edina razreda znakov, ki se smeta pri prevedbi pojaviti v nizu 2, sta ,upper` in ,lower`

source: the [c*] construct may appear in string2 only when translating
sl: konstrukt [c*] se sme pojaviti v nizu 2 le pri prevedbi

source: two strings must be given when translating
sl: pri prevedbi morata biti podana dva niza

source: two strings must be given when both deleting and squeezing repeats
sl: ob hkratnem veèkratnem brisanju in stiskanju morata biti podana dva niza

source: only one string may be given when deleting without squeezing repeats
sl: samo en niz sme biti podan kadar bri¹emo brez veèkratnega stiskanja

source: at least one string must be given when squeezing repeats
sl: vsaj en niz mora biti podan pri stiskanju veè znakov

source: misaligned [:upper:] and/or [:lower:] construct
sl: neporavnana konstrukta [:upper:] in/ali [:lower:]

source: invalid identity mapping; when translating, any [:lower:] or [:upper:] construct in string1 must be aligned with a corresponding construct ([:upper:] or [:lower:], respectively) in string2
sl: neveljavna identièna preslikava: pri prevedbi mora biti vsak konstrukt [:upper:] ali [:lower:] v nizu 1 poravnan z ustreznim konstruktom (torej [:lower:] ali [:upper:]) v nizu 2

source: Usage: %s [OPTION] [FILE] Write totally ordered list consistent with the partial ordering in FILE. With no FILE, or when FILE is -, read standard input.
sl: Uporaba: %s [IZBIRA] [DATOTEKA] Zapi¹emo povsem urejen seznam, usklajen z delno ureditvijo v DATOTEKI. Èe DATOTEKA ni podana ali je enaka -, beremo s standardnega vhoda.

source: %s: input contains a loop:
sl: %s: zanka na vhodu:

source: only one argument may be specified
sl: dovoljen je le en argument

source: Convert spaces in each FILE to tabs, writing to standard output. With no FILE, or when FILE is -, read standard input.
sl: Presledke v vsaki DATOTEKI nadomestimo s tabulatorji in rezultat zapi¹emo na standardni izhod. Èe DATOTEKA ni podana ali je enaka -, beremo s standardnega vhoda.

source: -a, --all convert all whitespace, instead of initial whitespace -t, --tabs=NUMBER have tabs NUMBER characters apart instead of 8 -t, --tabs=LIST use comma separated list of explicit tab positions
sl: -a, --all pretvorimo vse prazne prostore, ne le uvodnih -t, --tabs=©TEVILO tabulatorji naj bodo ©TEVILO znakov narazen (privzeto 8) -t, --tabs=SEZNAM z vejicami loèen seznam eksplicitnih polo¾ajev tabulatorja

source: Usage: %s [OPTION]... [INPUT [OUTPUT]]
sl: Uporaba: %s [IZBIRA]... [VHOD [IZHOD]]

source: Discard all but one of successive identical lines from INPUT (or standard input), writing to OUTPUT (or standard output).
sl: Sosledje enakih vrstic na VHODU (ali standardnem vhodu) nadomestimo z eno samo in rezultat zapi¹emo na IZHOD (standardni izhod).

source: -c, --count prefix lines by the number of occurrences -d, --repeated only print duplicate lines
sl: -c, --count na zaèetku vsake vrstice izpi¹emo tudi ¹tevilo ponovitev -d, --repeated izpi¹emo samo podvojene vrstice

source: A field is a run of whitespace, then non-whitespace characters. Fields are skipped before chars.
sl: Polje je zaporedje praznih znakov, ki mu sledi zaporedje nepraznih znakov. Najprej preskoèimo polja, potem znake.

source: error reading %s
sl: napaka pri branju %s

source: error writing %s
sl: napaka pri pisanju na %s

source: extra operand `%s'
sl: odveèni operand ,%s`

source: invalid number of fields to skip
sl: neveljavno ¹tevilo preskoèenih polj

source: invalid number of bytes to skip
sl: neveljavno ¹tevilo preskoèenih bajtov

source: invalid number of bytes to compare
sl: neveljavno ¹tevilo primerjanih bajtov

source: printing all duplicated lines and repeat counts is meaningless
sl: izpis vseh podvojenih vrstic skupaj s ¹tevilom ponovitev ni smiseln

source: Paul Rubin and David MacKenzie
sl: Paul Rubin in David MacKenzie

source: Print newline, word, and byte counts for each FILE, and a total line if more than one FILE is specified. With no FILE, or when FILE is -, read standard input. -c, --bytes print the byte counts -m, --chars print the character counts -l, --lines print the newline counts
sl: Izpi¹emo ¹tevilo vrstic, besed in bajtov v vsaki od podanih DATOTEK, in skupne vrednosti, èe je bila podana veè kot ena datoteka. Èe DATOTEKA ni podana ali je enaka -, beremo s standardnega vhoda. -c, --bytes izpi¹emo ¹tevilo bajtov -m, --chars izpi¹emo ¹tevilo znakov -l, --lines izpi¹emo ¹tevilo vrstic

source: -L, --max-line-length print the length of the longest line -w, --words print the word counts
sl: -L, --max-line-length izpi¹emo dol¾ino najdalj¹e vrstice -w, --words izpi¹emo ¹tevilo besed

source: total
sl: skupno
