Repository: SyllableOS/Syllable
Catalog: system/apps/gnu/textutils-2.0.21/po/*.po
Languages: sl

source: Write each FILE to standard output, with line numbers added. With no FILE, or when FILE is -, read standard input.
sl: Vsako od DATOTEK prepi¹emo na standardni izhod in spotoma o¹tevilèimo vrstice. Èe DATOTEKA ni podana, ali èe je enaka -, beremo s standardnega vhoda.

source: -b, --body-numbering=STYLE use STYLE for numbering body lines -d, --section-delimiter=CC use CC for separating logical pages -f, --footer-numbering=STYLE use STYLE for numbering footer lines
sl: -b, --body-numbering=SLOG uporabi SLOG pri o¹tevilèenju vrstic telesa -d, --section-delimiter=CC uporabi CC pri loèitvi logiènih strani -f, --footer-numbering=SLOG uporabi SLOG pri o¹tevilèenju zno¾ja strani

source: -h, --header-numbering=STYLE use STYLE for numbering header lines -i, --page-increment=NUMBER line number increment at each line -l, --join-blank-lines=NUMBER group of NUMBER empty lines counted as one -n, --number-format=FORMAT insert line numbers according to FORMAT -p, --no-renumber do not reset line numbers at logical pages -s, --number-separator=STRING add STRING after (possible) line number
sl: -h, --header-numbering=SLOG uporabi SLOG pri o¹tevilèenju zglavja strani -i, --page-increment=©TEVILO ¹tevilke vrstic inkrementiraj po ©TEVILO -l, --join-blank-lines=©TEVILO skupino ©TEVILA praznih vrstic ¹tej kot eno -n, --number-format=OBLIKA ¹tevilke vrstic vrini glede na OBLIKO -p, --no-renumber o¹tevilèenje vrstic naj teèe prek log. strani -s, --number-separator=NIZ pripni NIZ (mo¾ni) ¹tevilki vrstice

source: -v, --first-page=NUMBER first line number on each logical page -w, --number-width=NUMBER use NUMBER columns for line numbers
sl: -v, --first-page=©TEVILO ¹tevilka prve vrstice na novi logièni strani -w, --number-width=©TEVILO ©TEVILO znakov ¹irine za o¹tevilèenje

source: By default, selects -v1 -i1 -l1 -sTAB -w6 -nrn -hn -bt -fn. CC are two delimiter characters for separating logical pages, a missing second character implies :. Type \\ for \. STYLE is one of:
sl: Privzete so izbire -v1 -i1 -l1 -sTAB -w6 -nrn -hn -bt -fn. CC sta dva loèitvena znaka za loèevanje logiènih strani; èe je drugi znak izpu¹èen, se privzame :. Uporabite \\\\ za \\. SLOG je nekaj od na¹tetega:

source: a number all lines t number only nonempty lines n number no lines pREGEXP number only lines that contain a match for REGEXP FORMAT is one of: ln left justified, no leading zeros rn right justified, no leading zeros rz right justified, leading zeros
sl: a o¹tevilèi vse vrstice t o¹tevilèi samo polne vrstice, praznih ne n ne o¹tevilèi nobenih vrstic pREGIZR o¹tevilèi samo vrstice, ki se ujemajo z regularnim izrazom REGIZR OBLIKA je nekaj od na¹tetega: ln levo poravnano, brez vodilnih nièel rn desno poravnano, brez vodilnih nièel rz desno poravnano, z vodilnimi nièlami

source: invalid starting line number: `%s'
sl: neveljavna zaèetna ¹tevilka vrstice: ,%s`

source: invalid line number increment: `%s'
sl: neveljaven vrstièni inkrement: ,%s`

source: invalid number of blank lines: `%s'
sl: neveljavno ¹tevilo praznih vrstic: ,%s`

source: invalid line number field width: `%s'
sl: neveljavna ¹irina polja s ¹tevilko vrstice: ,%s`

source: Usage: %s [OPTION]... [FILE]... or: %s --traditional [FILE] [[+]OFFSET [[+]LABEL]]
sl: Uporaba: %s [IZBIRA]... [DATOTEKA]... ali: %s --traditional [DATOTEKA] [[+]ODMIK [[+]OZNAKA]]

source: Write an unambiguous representation, octal bytes by default, of FILE to standard output. With more than one FILE argument, concatenate them in the listed order to form the input. With no FILE, or when FILE is -, read standard input.
sl: Na standardni izhod zapi¹emo enoznaèno predstavitev DATOTEKE, privzeto osmi¹ki zapis bajtov. Èe DATOTEKA ni podana ali je enaka -, beremo s standardnega vhoda.

source: -A, --address-radix=RADIX decide how file offsets are printed -j, --skip-bytes=BYTES skip BYTES input bytes first
sl: -A, --address-radix=OSNOVA OSNOVA pri izpisu odmikov v datoteki (doxn) -j, --skip-bytes=©TEVILO pri vsaki datoteki preskoèimo prvih ©TEVILO bajtov

source: -f same as -t fF, select floats -h same as -t x2, select hexadecimal shorts -i same as -t d2, select decimal shorts -l same as -t d4, select decimal longs -o same as -t o2, select octal shorts -x same as -t x2, select hexadecimal shorts
sl: -f isto kot -t fF, izpis ¹tevil s plavajoèo vejico -h isto kot -t x2, ¹estnajsti¹ki izpis dvobajtnih celih ¹tevil -i isto kot -t d2, deseti¹ki izpis dvobajtnih predznaèenih celih ¹tevil -l isto kot -t d4, deseti¹ki izpis ¹tiribajtnih predznaèenih celih ¹tevil -o isto kot -t o2, osmi¹ki izpis dvobajtnih celih ¹tevil -x isto kot -t x2, ¹estnajsti¹ki izpis dvobajtnih celih ¹tevil

source: d[SIZE] signed decimal, SIZE bytes per integer f[SIZE] floating point, SIZE bytes per integer o[SIZE] octal, SIZE bytes per integer u[SIZE] unsigned decimal, SIZE bytes per integer x[SIZE] hexadecimal, SIZE bytes per integer
sl: d[VELIKOST] predznaèeno deseti¹ko celo ¹tevilo dol¾ine VELIKOST bajtov f[VELIKOST] ¹tevilo v plavajoèi vejici dol¾ine VELIKOST bajtov o[VELIKOST] osmi¹ko ¹tevilo dol¾ine VELIKOST bajtov u[VELIKOST] nepredznaèeno deseti¹ko celo ¹tevilo dol¾ine VELIKOST bajtov x[VELIKOST] ¹estnajsti¹ko ¹tevilo dol¾ine VELIKOST bajtov

source: SIZE is a number. For TYPE in doux, SIZE may also be C for sizeof(char), S for sizeof(short), I for sizeof(int) or L for sizeof(long). If TYPE is f, SIZE may also be F for sizeof(float), D for sizeof(double) or L for sizeof(long double).
sl: VELIKOST je ¹tevilka. Za TIPE d,o,u ali x je VELIKOST lahko tudi C, kar pomeni dol¾ino tipa char, S (dol¾ina tipa short), I (dol¾ina tipa int) ali L (dol¾ina tipa long). Èe je TIP f, je lahko VELIKOST tudi F za dol¾ino tipa float, D (dol¾ina tipa double) ali L (dol¾ina tipa long double).

source: RADIX is d for decimal, o for octal, x for hexadecimal or n for none. BYTES is hexadecimal with 0x or 0X prefix, it is multiplied by 512 with b suffix, by 1024 with k and by 1048576 with m. Adding a z suffix to any type adds a display of printable characters to the end of each line of output.
sl: OSNOVA je lahko d (deseti¹ka), o (osmi¹ka), x (¹estnajsti¹ka) ali n (nobena). Èe ima ©TEVILO predpono 0x ali 0X, se tolmaèi kot ¹estnajsti¹ka vrednost. Pripona b pomeni mno¾enje s 512, pripona k mno¾enje s 1024, pripona m mno¾enje s 1048576. Pripona z pri kateremkoli tipu doda prikaz izpisljivih znakov na koncu vsake vrstice.

source: invalid type string `%s'
sl: neveljaven tip ,%s`

source: invalid type string `%s'; this system doesn't provide a %lu-byte integral type
sl: neveljaven tip ,%s`; ta sistem ne omogoèa %lu-bajtnega celo¹tevilènega tipa

source: invalid type string `%s'; this system doesn't provide a %lu-byte floating point type
sl: neveljaven tip ,%s`; ta sistem ne omogoèa %lu-bajtnega zapisa v plavajoèi vejici

source: invalid character `%c' in type string `%s'
sl: neveljaven znak ,%c` v oznaki tipa ,%s`

source: cannot skip past end of combined input
sl: ni mo¾no prek konca kombiniranega vhoda

source: old-style offset
sl: odmik v starem slogu

source: invalid output address radix `%c'; it must be one character from [doxn]
sl: neveljavna osnova naslovov ,%c`; veljavne so mo¾nosti d, o, x in n

source: skip argument
sl: preskoèi argument

source: limit argument
sl: omeji argument

source: minimum string length
sl: najmanj¹a dol¾ina niza

source: %s is too large
sl: %s je preveliko

source: width specification
sl: doloèilo ¹irine

source: no type may be specified when dumping strings
sl: tip ne sme biti doloèen, kadar izna¹amo nize

source: invalid second operand in compatibility mode `%s'
sl: neveljaven drugi operand v zdru¾ljivostnem naèinu ,%s`

source: in compatibility mode, the last two arguments must be offsets
sl: v zdru¾ljivostnem naèinu morata biti zadnja dva argumenta odmika

source: compatibility mode supports at most three arguments
sl: zdru¾ljivostni naèin podpira najveè tri argumente

source: warning: invalid width %lu; using %d instead
sl: opozorilo: neveljavna ¹irina %lu; namesto nje jemljemo %d

source: David M. Ihnat and David MacKenzie
sl: David M. Ihnat in David MacKenzie

source: standard input is closed
sl: standardni vhod je zaprt

source: Write lines consisting of the sequentially corresponding lines from each FILE, separated by TABs, to standard output. With no FILE, or when FILE is -, read standard input.
sl: Vsaki od vrstic iz prve DATOTEKE s tabulatorjem na konec pridru¾imo istole¾no vrstico iz druge DATOTEKE, in tako naprej do konca seznama DATOTEK. Èe DATOTEKA ni podana ali je enaka -, beremo s standardnega vhoda.

source: -d, --delimiters=LIST reuse characters from LIST instead of TABs -s, --serial paste one file at a time instead of in parallel
sl: -d, --delimiters=SEZNAM za loèitev uporabimo znake s SEZNAMA namesto TAB -s, --serial datoteke zdru¾ujemo zaporedno namesto vzporedno

source: Pete TerMaat and Roland Huebner
sl: Pete TerMaat in Roland Huebner

source: `--pages' invalid range of page numbers: `%s'
sl: ,--pages` neveljavni obseg ¹tevilk strani: ,%s`

source: `--pages' invalid starting page number: `%s'
sl: ,--pages` neveljavna zaèetna ¹tevilka strani: ,%s`

source: `--pages' invalid ending page number: `%s'
sl: ,--pages` neveljavna konèna ¹tevilka strani: ,%s`

source: `--pages' starting page number is larger than ending page number
sl: ,--pages` zaèetna ¹tevilka strani je vi¹ja od konène

source: `--pages=FIRST_PAGE[:LAST_PAGE]' missing argument
sl: ,--pages=PRVA_STRAN[:ZADNJA_STRAN]`: manjkajoèi argument

source: `--columns=COLUMN' invalid number of columns: `%s'
sl: ,--columns=STOLPCI` neveljavno ¹tevilo stolpcev: ,%s`

source: `-l PAGE_LENGTH' invalid number of lines: `%s'
sl: ,-l DOL®INA_STRANI` nedovoljeno ¹tevilo vrstic: ,%s`

source: `-N NUMBER' invalid starting line number: `%s'
sl: ,-N ©TEVILKA` nedovoljena ¹tevilka zaèetne vrstice: ,%s`

source: `-o MARGIN' invalid line offset: `%s'
sl: ,-o ROB` nedovoljen odmik od levega roba: ,%s`

source: `-w PAGE_WIDTH' invalid number of characters: `%s'
sl: ,-w ©IRINA_STRANI` neveljavno ¹tevilo znakov: ,%s`

source: `-W PAGE_WIDTH' invalid number of characters: `%s'
sl: ,-W ©IRINA_STRANI` neveljavno ¹tevilo znakov: ,%s`

source: Cannot specify number of columns when printing in parallel.
sl: Pri vzporednem izpisu ni mo¾no doloèiti ¹tevila stolpcev

source: Cannot specify both printing across and printing in parallel.
sl: Mo¾nosti izpisa poèez in vzporednega izpisa se izkljuèujeta

source: `-%c' extra characters or invalid number in the argument: `%s'
sl: ,-%c` dodatni znaki ali neveljavno ¹tevilo v argumentu: ,%s`

source: page width too narrow
sl: ¹irina strani premajhna

source: starting page number larger than total number of pages: `%d'
sl: zaèetna stran je vi¹ja od celotnega ¹tevila strani: ,%d`

source: Page %d
sl: Str. %d

source: Paginate or columnate FILE(s) for printing.
sl: O¹tevilèimo strani ali poravnamo besedilo v DATOTEKI v stolpce za izpis.

source: +FIRST_PAGE[:LAST_PAGE], --pages=FIRST_PAGE[:LAST_PAGE] begin [stop] printing with page FIRST_[LAST_]PAGE -COLUMN, --columns=COLUMN produce COLUMN-column output and print columns down, unless -a is used. Balance number of lines in the columns on each page.
sl: +PRVA_STRAN[:ZADNJA_STRAN], --pages=PRVA_STRAN[:ZADNJA_STRAN] tiskanje zaènemo na PRVI in konèamo na ZADNJI STRANI -STOLPCI, --columns=STOLPCI izpis v danem ¹tevilu STOLPCEV, ki teèejo od zgoraj navzdol razen èe je izbrano -a. ©tevilo vrstic v stolpcih na strani je uravnote¾eno.

source: -a, --across print columns across rather than down, used together with -COLUMN -c, --show-control-chars use hat notation (^G) and octal backslash notation -d, --double-space double space the output
sl: -a, --across skupaj s -STOLPCI; stolpce tiskamo poprek prek strani namesto navzdol. -c, --show-control-chars uporabimo zapis ^G in osmi¹ki zapis z uvodno nagibnico -d, --double-space izpis z dvojnim razmakom

source: -D, --date-format=FORMAT use FORMAT for the header date -e[CHAR[WIDTH]], --expand-tabs[=CHAR[WIDTH]] expand input CHARs (TABs) to tab WIDTH (8) -F, -f, --form-feed use form feeds instead of newlines to separate pages (by a 3-line page header with -F or a 5-line header and trailer without -F)
sl: -D, --date-format=OBLIKA izpis datuma v glavi v navedeni OBLIKI -e[ZNAK[©IRINA]], --expand-tabs[=ZNAK[©IRINA]] ZNAKE (privzeto TAB) na vhodu raz¹irimo v tabulator dane ©IRINE (privzeto 8) -F, -f, --form-feed strani loèimo z znaki za skok na novo stran namesto s praznimi vrsticami (s 3-vrstiènim zglavjem z izbiro -F ali 5-vrstiènim zglavjem in zno¾jem brez -F)

source: -l PAGE_LENGTH, --length=PAGE_LENGTH set the page length to PAGE_LENGTH (66) lines (default number of lines of text 56, and with -F 63) -m, --merge print all files in parallel, one in each column, truncate lines, but join lines of full length with -J
sl: -l DOL®INA_STRANI, --length=DOL®INA_STRANI doloèimo DOL®INO STRANI, v vrsticah (privzeto 66) (privzeto ¹tevilo vrstic besedila je 56, z -F 63) -m, --merge datoteke izpisujemo vzporedno, po eno v stolpec. Predolge vrstice pore¾emo, razen z izbiro -J, kjer zdru¾imo celotne

source: -n[SEP[DIGITS]], --number-lines[=SEP[DIGITS]] number lines, use DIGITS (5) digits, then SEP (TAB), default counting starts with 1st line of input file -N NUMBER, --first-line-number=NUMBER start counting with NUMBER at 1st line of first page printed (see +FIRST_PAGE)
sl: -n[LOÈ[©TEVILO]], --number-lines[=LOÈ[©TEVILO]] vrstice o¹tevilèimo, ¹irina polja je ©TEVILO (privzeto 5) znakov, sledi LOÈ (privzeto TAB). O¹tevilèenje gre od prve vrstice vhodne datoteke. -N ©TEVILO, --first-line-number=©TEVILO o¹tevilèenje zaènemo z navedenim ©TEVILOM v prvi vrstici na prvi natisnjeni strani (glej +PRVA_STRAN)

source: -o MARGIN, --indent=MARGIN offset each line with MARGIN (zero) spaces, do not affect -w or -W, MARGIN will be added to PAGE_WIDTH -r, --no-file-warnings omit warning when a file cannot be opened
sl: -o ROB, --indent=ROB vrstice zamaknemo za ROB znakov od levega roba; ne vpliva na -w in -W; ROB se pri¹teje ©IRINI_STRANI. -r, --no-file-warnings brez opozoril, kadar ni mo¾no odpreti datoteke

source: -s[CHAR],--separator[=CHAR] separate columns by a single character, default for CHAR is the <TAB> character without -w and 'no char' with -w -s[CHAR] turns off line truncation of all 3 column options (-COLUMN|-a -COLUMN|-m) except -w is set
sl: -s[ZNAK], --separator[=ZNAK] stolpce loèimo z navedenim ZNAKOM (privzeto TAB) namesto s presledki.

source: -T, --omit-pagination omit page headers and trailers, eliminate any pagination by form feeds set in input files -v, --show-nonprinting use octal backslash notation -w PAGE_WIDTH, --width=PAGE_WIDTH set page width to PAGE_WIDTH (72) characters for multiple text-column output only, -s[char] turns off (72)
sl: -T, --omit-pagination brez zglavja in repa; brez o¹tevilèenja strani, ki jih povzroèijo znaki za skok na novo stran v vhodni datoteki -v, --show-nonprinting z uporabo osmi¹kih vrednosti z ube¾nimi zaporedji -w ©IRINA_STRANI, --width=©IRINA_STRANI ©IRINO STRANI nastavimo na dano ¹tevilo znakov (privz. 72); samo besedilo v veè stolpcih; -s[znak] izklopi

source: -W PAGE_WIDTH, --page-width=PAGE_WIDTH set page width to PAGE_WIDTH (72) characters always, truncate lines, except -J option is set, no interference with -S or -s
sl: -W ©IRINA_STRANI, --page-width=©IRINA_STRANI ©IRINO STRANI nastavimo na dano ¹tevilo znakov (privz. 72); predolge vrstice pore¾emo razen z izbiro -J; ne vpliva na izbiri -s in -S

source: -T implied by -l nn when nn <= 10 or <= 3 with -F. With no FILE, or when FILE is -, read standard input.
sl: V dveh primerih se privzame -T: pri izbiri -l NN, kadar NN <= 10; ter pri izbiri -F, kadar je NN <= 3. Kadar DATOTEKA ni podana ali je enaka -, beremo s standardnega vhoda.

source: %s (for regexp `%s')
sl: %s (za regularni izraz ,%s`)

source: Usage: %s [OPTION]... [INPUT]... (without -G) or: %s -G [OPTION]... [INPUT [OUTPUT]]
sl: Uporaba: %s [IZBIRA]... [VHOD]... (brez -G) ali: %s -G [IZBIRA]... [VHOD [IZHOD]]

source: Output a permuted index, including context, of the words in the input files.
sl: Izpis permutiranega kazala gesel v vhodnih datotekah, skupaj s kontekstom.

source: -A, --auto-reference output automatically generated references -C, --copyright display Copyright and copying conditions -G, --traditional behave more like System V `ptx' -F, --flag-truncation=STRING use STRING for flagging line truncations
sl: -A, --auto-reference izpis samodejno generiranih vnosov -C, --copyright izpis dovoljenja za uporabo, razmno¾evanje in raz¹irjanje -G, --traditional obna¹anje kot ,ptx` v sistemu System V -F, --flag-truncation=NIZ za oznaèevanje okraj¹anih vrstic uporabi NIZ

source: -M, --macro-name=STRING macro name to use instead of `xx' -O, --format=roff generate output as roff directives -R, --right-side-refs put references at right, not counted in -w -S, --sentence-regexp=REGEXP for end of lines or end of sentences -T, --format=tex generate output as TeX directives
sl: -M, --macro-name=NIZ uporabi podano ime makroukaza (privzeto ,xx`) -O, --format=roff izpis v obliki stavnega jezika roff -R, --right-side-refs sklici ob desnem robu (niso v¹teti v -w) -S, --sentence-regexp=REGIZR za konce vrstic ali konce stavkov -T, --format=tex izpis v obliki stavnega jezika tex

source: -W, --word-regexp=REGEXP use REGEXP to match each keyword -b, --break-file=FILE word break characters in this FILE -f, --ignore-case fold lower case to upper case for sorting -g, --gap-size=NUMBER gap size in columns between output fields -i, --ignore-file=FILE read ignore word list from FILE -o, --only-file=FILE read only word list from this FILE
sl: -W, --word-regexp=REGIZR uporabi REGIZR za lovljenje besed -b, --break-file=DATOTEKA znake v podani DATOTEKI razlomi po besedah -f, --ignore-case pri urejanju obravnavaj male in velike èrke enako -g, --gap-size=©TEVILO ¹irina razmaka v znakih med polji v izpisu -i, --ignore-file=DATOTEKA seznam prezrtih besed preberi iz DATOTEKE -o, --only-file=FILE preberi le seznam besed iz navedene DATOTEKE

source: -r, --references first field of each line is a reference -t, --typeset-mode - not implemented - -w, --width=NUMBER output width in columns, reference excluded
sl: -r, --references prvo polje v vsaki vrstici je sklic -t, --typeset-mode - ni izvedeno - -w, --width=©TEVILO ¹irina izhoda v znakih, brez sklicev

source: With no FILE or if FILE is -, read Standard Input. `-F /' by default.
sl: Kadar DATOTEKA ni podana ali je enaka -, se bere standardni vhod. Privzeto oznaèevanje okraj¹anih vrstic je ,-F /`.

source: This program is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2, or (at your option) any later version.
sl: Ta program je prosta programska oprema; lahko ga redistribuirate in/ali spreminjate po pogojih, doloèenih v ,,GNU General Public License``, izdani pri Free Software Foundation; 2. izdaja (ali novej¹a, èe razpolagate z njo).

source: This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.
sl: Ta program se raz¹irja v upanju, da je koristen, vendar BREZ KAKR©NEGAKOLI JAMSTVA, niti jamstev USTREZNOSTI ZA PRODAJO ali PRIMERNOSTI ZA UPORABO. Za podrobnosti si oglejte ,,GNU General Public License``.

source: You should have received a copy of the GNU General Public License along with this program; if not, write to the Free Software Foundation, Inc., 59 Temple Place - Suite 330, Boston, MA 02111-1307, USA.
sl: Izvod ,,GNU General Public License`` bi moral biti prilo¾en temu programu; èe ni, pi¹ite Free Software Foundation, Inc., 59 Temple Place - Suite 330, Boston, MA 02111-1307, USA.

source: Mike Haertel and Paul Eggert
sl: Mike Haertel in Paul Eggert

source: Write sorted concatenation of all FILE(s) to standard output. Ordering options:
sl: Vsebino vseh DATOTEK na vhodu zdru¾imo, uredimo, in izpi¹emo na standarni izhod. Izbire pri urejanju:

source: -b, --ignore-leading-blanks ignore leading blanks -d, --dictionary-order consider only blanks and alphanumeric characters -f, --ignore-case fold lower case to upper case characters
sl: -b, --ignore-leading-blanks ne upo¹tevamo vodilnih presledkov v poljih, po katerih urejamo -d, --dictionary-order v kljuèih upo¹tevamo samo znake [a-zA-Z0-9 ] -f , --ignore-case male in velike èrke so v kljuèih enakovredne

source: -g, --general-numeric-sort compare according to general numerical value -i, --ignore-nonprinting consider only printable characters -M, --month-sort compare (unknown) < `JAN' < ... < `DEC' -n, --numeric-sort compare according to string numerical value -r, --reverse reverse the result of comparisons
sl: -g, --general-numeric-sort primerjamo po splo¹ni ¹tevilski vrednosti -i, --ignore-nonprinting v kljuèih upo¹tevamo samo izpisljive znake -M, --month-sort kljuèe urejamo: (neznano) < ,jan` < ... < ,dec` -n, --numeric-sort primerjamo po ¹tevilski vrednosti nizov -r, --reverse izpis v obrnjenem vrstnem redu

source: Other options: -c, --check check whether input is sorted; do not sort -k, --key=POS1[,POS2] start a key at POS1, end it at POS 2 (origin 1) -m, --merge merge already sorted files; do not sort -o, --output=FILE write result to FILE instead of standard output -s, --stable stabilize sort by disabling last-resort comparison -S, --buffer-size=SIZE use SIZE for main memory buffer
sl: Druge izbire: -c, --check èe je datoteka ¾e urejena, je ne urejamo znova -k, --key=POZ1[,POZ2] kljuè se zaène v stolpcu POZ1 in konèa v stolpcu POZ2. Stolpci se ¹tejejo od 1 dalje. -m, --merge ¾e urejene datoteke zdru¾imo brez ponovnega urejanja -o, --output=DATOTEKA izhod pi¹emo na DATOTEKO namesto na standardni izhod -s, --stable urejanje stabiliziramo z onemogoèenjem skrajnih primerjav -S, --buffer-size=VELIKOST doloèimo VELIKOST medpomnilnika

source: -t, --field-separator=SEP use SEP instead of non- to whitespace transition -T, --temporary-directory=DIR use DIR for temporaries, not $TMPDIR or %s multiple options specify multiple directories -u, --unique with -c: check for strict ordering otherwise: output only the first of an equal run
sl: -t, --field-separator=LOÈILO LOÈILO namesto mej med znaki in praznimi prostori -T, --temporary-directory=IMENIK uporabi IMENIK za zaèasne datoteke namesto $TMPDIR ali %s razliène izbire doloèajo razliène imenike -u, --unique skupaj z -c, preverjamo za strogo urejenost; sicer izpi¹emo samo prve od zaporednih enakih vrstic

source: cannot create temporary file
sl: zaèasne datoteke ni mogoèe ustvariti

source: open failed
sl: odpiranje ni uspelo

source: close failed
sl: zapiranje ni uspelo

source: write failed
sl: pisanje ni uspelo

source: sort size
sl: velikost urejanja

source: stat failed
sl: poizvedba po statusu ni uspela

source: read failed
sl: branje ni uspelo

source: %s: %s:%s: disorder:
sl: %s: %s:%s: neurejenost:

source: standard error
sl: standardna napaka

source: %s: invalid field specification `%s'
sl: %s: neveljavno doloèijo polja: ,%s`

source: %s: count `%.*s' too large
sl: %s: ¹tevec ,%.*s` je prevelik

source: %s: invalid count at start of `%s'
sl: %s: neveljaven ¹tevec na zaèetku ,%s`

source: invalid number after `-'
sl: neveljavno ¹tevilo za ,-`

source: invalid number after `.'
sl: neveljavno ¹tevilo za ,.`

source: stray character in field spec
sl: zablodeli znak v doloèilu polja

source: invalid number at field start
sl: neveljavno ¹tevilo zaèetka polja

source: field number is zero
sl: ¹tevilka polja je niè

source: character offset is zero
sl: znakovni zamik je niè

source: invalid number after `,'
sl: neveljavno ¹tevilo za ","

source: multi-character tab `%s'
sl: veèznakovni tabulator ,%s`
